###################################################################

# Created by write_sdc on Sat Jan 28 09:49:04 2017

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_max_fanout 4 [current_design]
create_clock [get_ports wb_clk_i]  -period 6  -waveform {0 3}
set_clock_uncertainty -setup 0.2  [get_clocks wb_clk_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports wb_rst_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports wb_rst_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports arst_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports arst_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_adr_i[2]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_adr_i[2]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_adr_i[1]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_adr_i[1]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_adr_i[0]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_adr_i[0]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[7]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[7]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[6]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[6]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[5]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[5]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[4]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[4]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[3]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[3]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[2]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[2]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[1]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[1]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_i[0]}]
set_input_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_i[0]}]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports wb_we_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports wb_we_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports wb_stb_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports wb_stb_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports wb_cyc_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports wb_cyc_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports scl_pad_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports scl_pad_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports sda_pad_i]
set_input_delay -clock wb_clk_i  -min 2  [get_ports sda_pad_i]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports VDD]
set_input_delay -clock wb_clk_i  -min 2  [get_ports VDD]
set_input_delay -clock wb_clk_i  -max 2.4  [get_ports VSS]
set_input_delay -clock wb_clk_i  -min 2  [get_ports VSS]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[7]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[7]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[6]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[6]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[5]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[5]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[4]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[4]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[3]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[3]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[2]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[2]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[1]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[1]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports {wb_dat_o[0]}]
set_output_delay -clock wb_clk_i  -min 2  [get_ports {wb_dat_o[0]}]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports wb_ack_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports wb_ack_o]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports wb_inta_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports wb_inta_o]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports scl_pad_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports scl_pad_o]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports scl_padoen_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports scl_padoen_o]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports sda_pad_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports sda_pad_o]
set_output_delay -clock wb_clk_i  -max 2.4  [get_ports sda_padoen_o]
set_output_delay -clock wb_clk_i  -min 2  [get_ports sda_padoen_o]
